k6-logs/20251004-115848/k6-delete_appointment_test-20251004-115851.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: C:\xampp\htdocs\tests\patient\delete_appointment_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  â–ˆ TOTAL RESULTS 

    checks_total.......: 1       17.268115/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    âœ“ delete appointment page ok

    HTTP
    http_req_duration..............: avg=14.63ms min=2.96ms  med=3.99ms  max=36.95ms p(90)=30.36ms p(95)=33.65ms
      { expected_response:true }...: avg=14.63ms min=2.96ms  med=3.99ms  max=36.95ms p(90)=30.36ms p(95)=33.65ms
    http_req_failed................: 0.00%  0 out of 3
    http_reqs......................: 3      51.804345/s

    EXECUTION
    iteration_duration.............: avg=57.91ms min=57.91ms med=57.91ms max=57.91ms p(90)=57.91ms p(95)=57.91ms
    iterations.....................: 1      17.268115/s

    NETWORK
    data_received..................: 6.5 kB 113 kB/s
    data_sent......................: 518 B  8.9 kB/s



running (00m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default âœ“ [ 100% ] 1 VUs  00m00.1s/10m0s  1/1 iters, 1 per VU