k6-logs/20251004-115848/k6-doctors_test-20251004-115852.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: C:\xampp\htdocs\tests\patient\doctors_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  â–ˆ TOTAL RESULTS 

    checks_total.......: 1       7.644249/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    âœ“ patient doctors ok

    HTTP
    http_req_duration..............: avg=58.14ms min=4.01ms  med=58.14ms max=112.27ms p(90)=101.45ms p(95)=106.86ms
      { expected_response:true }...: avg=58.14ms min=4.01ms  med=58.14ms max=112.27ms p(90)=101.45ms p(95)=106.86ms
    http_req_failed................: 0.00% 0 out of 2
    http_reqs......................: 2     15.288498/s

    EXECUTION
    iteration_duration.............: avg=130.8ms min=130.8ms med=130.8ms max=130.8ms  p(90)=130.8ms  p(95)=130.8ms 
    iterations.....................: 1     7.644249/s

    NETWORK
    data_received..................: 12 kB 92 kB/s
    data_sent......................: 319 B 2.4 kB/s



running (00m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default âœ“ [ 100% ] 1 VUs  00m00.1s/10m0s  1/1 iters, 1 per VU