k6-logs/20251004-115848/k6-edit_user_test-20251004-115852.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: C:\xampp\htdocs\tests\patient\edit_user_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  â–ˆ TOTAL RESULTS 

    checks_total.......: 1       6.925649/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    âœ“ edit user page ok

    HTTP
    http_req_duration..............: avg=43.63ms  min=4.38ms   med=59.87ms  max=66.63ms  p(90)=65.28ms  p(95)=65.95ms 
      { expected_response:true }...: avg=43.63ms  min=4.38ms   med=59.87ms  max=66.63ms  p(90)=65.28ms  p(95)=65.95ms 
    http_req_failed................: 0.00% 0 out of 3
    http_reqs......................: 3     20.776947/s

    EXECUTION
    iteration_duration.............: avg=143.39ms min=143.39ms med=143.39ms max=143.39ms p(90)=143.39ms p(95)=143.39ms
    iterations.....................: 1     6.925649/s

    NETWORK
    data_received..................: 22 kB 151 kB/s
    data_sent......................: 525 B 3.6 kB/s



running (00m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default âœ“ [ 100% ] 1 VUs  00m00.1s/10m0s  1/1 iters, 1 per VU