k6-logs/20251004-115848/k6-index_test-20251004-115853.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: C:\xampp\htdocs\tests\patient\index_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  â–ˆ TOTAL RESULTS 

    checks_total.......: 1       10.768134/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    âœ“ patient index ok

    HTTP
    http_req_duration..............: avg=38.9ms  min=3.33ms  med=38.9ms  max=74.47ms p(90)=67.36ms p(95)=70.92ms
      { expected_response:true }...: avg=38.9ms  min=3.33ms  med=38.9ms  max=74.47ms p(90)=67.36ms p(95)=70.92ms
    http_req_failed................: 0.00% 0 out of 2
    http_reqs......................: 2     21.536268/s

    EXECUTION
    iteration_duration.............: avg=92.86ms min=92.86ms med=92.86ms max=92.86ms p(90)=92.86ms p(95)=92.86ms
    iterations.....................: 1     10.768134/s

    NETWORK
    data_received..................: 20 kB 213 kB/s
    data_sent......................: 317 B 3.4 kB/s



running (00m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default âœ“ [ 100% ] 1 VUs  00m00.1s/10m0s  1/1 iters, 1 per VU