k6-logs/20251004-115848/k6-patient_test-20251004-115858.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: C:\xampp\htdocs\tests\patient\patient_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations for each of 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  â–ˆ TOTAL RESULTS 

    checks_total.......: 1       6.044941/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    âœ“ patient self page ok

    HTTP
    http_req_duration..............: avg=47.59ms  min=3.62ms   med=5.03ms   max=134.13ms p(90)=108.31ms p(95)=121.22ms
      { expected_response:true }...: avg=47.59ms  min=3.62ms   med=5.03ms   max=134.13ms p(90)=108.31ms p(95)=121.22ms
    http_req_failed................: 0.00%  0 out of 3
    http_reqs......................: 3      18.134822/s

    EXECUTION
    iteration_duration.............: avg=164.43ms min=164.43ms med=164.43ms max=164.43ms p(90)=164.43ms p(95)=164.43ms
    iterations.....................: 1      6.044941/s

    NETWORK
    data_received..................: 9.8 kB 60 kB/s
    data_sent......................: 486 B  2.9 kB/s



running (00m00.2s), 0/1 VUs, 1 complete and 0 interrupted iterations
default âœ“ [ 100% ] 1 VUs  00m00.2s/10m0s  1/1 iters, 1 per VU